app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
      redirect_to book_path(@book.id), notice: 'Book was successfully created.'
    else
      @books = Book.all
---
INSERT INTO "books" ("body", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?)  [["body", "e"], ["created_at", "2020-05-16 03:15:38.350284"], ["updated_at", "2020-05-16 03:15:38.350284"], ["title", "e"]]
SELECT "books".* FROM "books"